#### Terraform Plan 🖌 🤖 ⚙️ 📖  `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.product_a.azurerm_key_vault_secret.key_vault[0] will be created
  + resource "azurerm_key_vault_secret" "key_vault" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/9c5af5e1-c137-450c-8845-6465fa087443/resourceGroups/product3-fulano-dev/providers/Microsoft.KeyVault/vaults/akv-product3-fulano-dev"
      + name                    = "apfs-product3-fulano-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.product_a.random_password.postgresql_administrator_password[0] will be created
  + resource "random_password" "postgresql_administrator_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server.postgresql_flexible_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgresql_flexible_server" {
      + administrator_login           = "postgres"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "apfs-product3-fulano-dev"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "product3-fulano-dev"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + storage_mb                    = 32768
      + tags                          = {
          + "client"  = "fulano"
          + "product" = "product3"
        }
      + version                       = "14"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_configuration.postgresql_flexible_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "postgresql_flexible_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql,pg_stat_statements,pg_buffercache,pgcrypto,citext"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_database.postgresql_flexible_db["backend"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "postgresql_flexible_db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + name      = "backend"
      + server_id = (known after apply)
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_database.postgresql_flexible_db["hasura"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "postgresql_flexible_db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + name      = "hasura"
      + server_id = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @nelsonrp24*